---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewportSheetNumber
source: html/bf95cb91-2621-600e-92ae-db8f12576fa5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewportSheetNumber Property

"Sheet Number"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewportSheetNumber { get; }
```